from bs4 import BeautifulSoup
import requests

temp=[]
osadki=[]

temp2=[]
osadki2=[]

# 26063 - Санкт-Петербург - широта 59.97, долгота 30.30
# 22550 - Архангельск - широта 64.50, долгота 40.73
# 27037 - Вологда - широта 59.32, долгота 39.93
# 26702 - Калининград - широта 54.70, долгота 20.62
# 22113 - Мурманск - широта 68.97, долгота 33.05
# 26258 - Псков - широта 57.82, долгота 28.33
# 22820 - Петрозаводск - широта 61.82, долгота 34.27
# 23804 - Сыктывкар - широта 61.68, долгота 50.78
# 23205 - Нарьян-Мар - широта 67.63, долгота 53.02
# 26275 - Старая Русса - широта 58.02, долгота 31.32
# 27113 - Череповец - широта 59.25, долгота 37.97
# 26477 - Великие Луки - широта 56.35, долгота 30.62
# 23606 - Ухта - широта 63.55, долгота 53.82
# 22892 - Выборг - широта 60.72, долгота 28.73
# 23226 - Воркута - широта 67.48, долгота 63.97
# 22887 - Котлас - широта 61.23, долгота 46.72
# 26094 - Тихвин - широта 59.65, долгота 33.55
# 26059 - Кингисепп - широта 59.37, долгота 28.60
# 23418 - Печора - широта 65.12, долгота 57.10
# 22217 - Кандалакша - широта 67.15, долгота 32.35
# 22641 - Онега - широта 63.90, долгота 38.12


ids = [26063, 22550, 27037, 26702, 22113, 26258, 22820, 23804, 23205, 26275, 27113, 26477, 23606, 22892, 23226, 22887, 26094, 26059, 23418, 22217, 22641]
print(len(ids))

for id in ids:
    print(id)
    for e in range(2020,2023):
        print('\n',e)
        for i in range(1,13):
            url = 'http://www.pogodaiklimat.ru/monitor.php?id='+str(id)+'&month='+str(i)+'&year='+str(e)
            page = requests.get(url)
            soup = BeautifulSoup(page.text, "html.parser")
            table = soup.findAll('tr')
            for row in table[2:]:
                td = row.findAll('td')
                if td[2].text and td[-1].text:
                    temp.append(float(td[2].text))
                    osadki.append(float(td[-1].text))
        for i in range(len(temp)):
            if temp[i] >= 10:
                temp2.append(temp[i])
                osadki2.append(osadki[i])
        print(sum(osadki2) * 10 / sum(temp2))
        temp.clear()
        temp2.clear()
        osadki.clear()
        osadki2.clear()
    print('\n')